In [1]:
import pandas as pd

series1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])
series1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [2]:
#使用subscript[]
series1['d']
#使用subsccript[index]
series1[0]
#使用subscript[slice]
series1['d':'a']

C:\Users\Bill\AppData\Local\Temp\ipykernel_1116\2365226058.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series1[0]

d    4.5
b    7.2
a   -5.3
dtype: float64

In [3]:
display(series1)
#重新排序,實體方法reindex()
series1.reindex(['a','b','c','d'])
#選取想要的索引
series1.reindex(['a','b'])

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
dtype: float64

In [4]:
display(series1)
#取出ndArray
series1.values
#轉換成為list
series1.to_list()

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

[4.5, 7.2, -5.3, 3.6]

In [5]:
import numpy as np
import pandas as pd


frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
             index = ['a','c','d'],
             columns = ['台北','台中','高雄']
             )
frame1

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [6]:
#利用subscript[],取出資料
#dataframe[],取出的是整欄
frame1['台北']

a    0
c    3
d    6
Name: 台北, dtype: int32

In [7]:
frame1[['台北','台中']]

   台北  台中
a   0   1
c   3   4
d   6   7

In [8]:
display(frame1)
#iloc[]
#loc[]

frame1.iloc[0]
frame1.loc[['a','c']]

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

   台北  台中  高雄
a   0   1   2
c   3   4   5